In [19]:
#Prepare the Titanic dataset file.
import pandas as pd
titanic_dataset=pd.read_csv('C:\\Users\\rauts\\OneDrive\Documents\\titanic_dataset.csv')
print(titanic_dataset)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  Unnamed: 12  \
0        0         A/5 21171   7.2500   NaN        S          NaN
1        0          PC 17599  71.2833   C85        C          NaN
2        0  STON/O2. 3101282   7.9250   NaN        S          NaN
3        0            113803  53.1000  C123        S          NaN
4        0            373450   8.0500   NaN        S          NaN
..     ...               ...      ...   ...      ...          ...
886      0            211536  13.0000   NaN        S          NaN
887      0            112053  30.0000   B42        S          NaN
888      2        W./C. 6607  23.4500   NaN        S          NaN
889      0            111369  30.0000  C148        C          NaN
890      0            370376   7.7500   NaN        Q          NaN

     Unnamed: 13  Unnamed: 14  Unnamed: 15  Unnamed: 16
0            NaN          NaN          NaN          NaN
1            NaN          NaN          NaN          NaN
2            NaN          NaN          NaN          NaN
3            NaN          NaN          NaN          NaN
4            NaN          NaN          NaN          NaN
..           ...          ...          ...          ...
886          NaN          NaN          NaN          NaN
887          NaN          NaN          NaN          NaN
888          NaN          NaN          NaN          NaN
889          NaN          NaN          NaN          NaN
890          NaN          NaN          NaN          NaN

[891 rows x 17 columns]

In [23]:
#Find out the names of passengers younger than 35 years.
Age_35=titanic_dataset[titanic_dataset["Age"]<35]
print(Age_35)

     PassengerId  Survived  Pclass  \
0              1         0       3
2              3         1       3
7              8         0       3
8              9         1       3
9             10         1       2
..           ...       ...     ...
884          885         0       3
886          887         0       2
887          888         1       1
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
..                                                 ...     ...   ...    ...
884                             Sutehall, Mr. Henry Jr    male  25.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  Unnamed: 12  \
0        0         A/5 21171   7.2500   NaN        S          NaN
2        0  STON/O2. 3101282   7.9250   NaN        S          NaN
7        1            349909  21.0750   NaN        S          NaN
8        2            347742  11.1333   NaN        S          NaN
9        0            237736  30.0708   NaN        C          NaN
..     ...               ...      ...   ...      ...          ...
884      0   SOTON/OQ 392076   7.0500   NaN        S          NaN
886      0            211536  13.0000   NaN        S          NaN
887      0            112053  30.0000   B42        S          NaN
889      0            111369  30.0000  C148        C          NaN
890      0            370376   7.7500   NaN        Q          NaN

     Unnamed: 13  Unnamed: 14  Unnamed: 15  Unnamed: 16
0            NaN          NaN          NaN          NaN
2            NaN          NaN          NaN          NaN
7            NaN          NaN          NaN          NaN
8            NaN          NaN          NaN          NaN
9            NaN          NaN          NaN          NaN
..           ...          ...          ...          ...
884          NaN          NaN          NaN          NaN
886          NaN          NaN          NaN          NaN
887          NaN          NaN          NaN          NaN
889          NaN          NaN          NaN          NaN
890          NaN          NaN          NaN          NaN

[479 rows x 17 columns]

In [33]:
#Print the rows from index 10 to 25 and columns 3 to 5.
data=titanic_dataset.iloc[10:25, 3:5]
print(data)

                                                 Name     Sex
10                    Sandstrom, Miss. Marguerite Rut  female
11                           Bonnell, Miss. Elizabeth  female
12                     Saundercock, Mr. William Henry    male
13                        Andersson, Mr. Anders Johan    male
14               Vestrom, Miss. Hulda Amanda Adolfina  female
15                   Hewlett, Mrs. (Mary D Kingcome)   female
16                               Rice, Master. Eugene    male
17                       Williams, Mr. Charles Eugene    male
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19                            Masselmani, Mrs. Fatima  female
20                               Fynney, Mr. Joseph J    male
21                              Beesley, Mr. Lawrence    male
22                        McGowan, Miss. Anna "Annie"  female
23                       Sloper, Mr. William Thompson    male
24                      Palsson, Miss. Torborg Danira  female

In [34]:
#Find out the statistics aggregate of Age & Fare using the DataFrame.agg() method.
Aggregate=titanic_dataset.agg(
    {
        "Age": ["min", "max", "median", "mean"],
        "Fare": ["min", "max", "median", "mean"],
    }
)
print(Aggregate)

              Age        Fare
min      0.420000    0.000000
max     80.000000  512.329200
median  28.000000   14.454200
mean    29.699118   32.204208

In [35]:
#Find out the mean ticket fare price for each of the sex and cabin class combinations.
mean=titanic_dataset.groupby(["Sex", "Pclass"])["Fare"].mean()
print(mean)

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64